Revit 2027 API
PerformanceAdviser.IsRuleEnabled Method
Overload List
Name | Description
IsRuleEnabled(Int32) |  Retrieves an enabled/disabled status for the given rule.
IsRuleEnabled(PerformanceAdviserRuleId) |  Retrieves an enabled/disabled status for the given rule.
Top
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace